LESSON_TYPE = {
    0: 'Лекция',
    1: 'Практика',
    2: 'Лабораторная',
    3: 'Групповая консультанция',
    4: 'Экзамен',
}


REVERS_LESSON_TYPE = {
    'Лекция': 0,
    'Практика': 1,
    'Лабораторная': 2,
    'Групповая консультация': 3,
    'Экзамен': 4
}


HOURS_TYPE = {
    0: '8:30-10:00',
    1: '10:10-11:40',
    2: '12:10-13:40',
    3: '13:50-15:20',
    4: '15:30-17:00',
    5: '17:10-18:40',
    6: '18:50-20:20',
    7: '20:30-22:00'
}


INSTITUTS = {
    1: 'ИГиМ',
    2: 'ИКиП',
    3: 'ИОиТИБ'
}


COURSES = {
    1: [1, 2, 3, 4, 5, 6, 7],
    2: [1, 2, 3, 4, 5],
    3: [1, 2, 3, 4, 5]
}


EDUCATION_FORMS = {
    'Очная': 1,
    'Заочная': 2,
    'Очно-заочная': 3,
    'Заочная ускоренная': 4,
    'Очно-заочная ускоренная': 5,
}


BUILDINGS = {
    0: 'Основной',
    1: 'Лабораторный',
}


BOT_TOKEN = '5993068182:AAHBBY9rXcyJBM2nwGq--mS6ie7fe_t6bUU'


MONTHS_LIST = ['Январь', 'Февраль', 'Март', 'Апрель', 'Май', 'Июнь', 'Июль', 'Август', 'Сентябрь', 'Октябрь', 'Ноябрь', 'Декабрь']


WEEKDAY_LIST = [ 'ПН', 'ВТ', 'СР', 'ЧТ', 'ПТ', 'СБ', 'ВС' ]


WEEKDAYS_TEXT = {
    0: 'Понедельник',
    1: 'Вторинк',
    2: 'Среда',
    3: 'Четверг',
    4: 'Пятница',
    5: 'Суббота',
    6: 'Воскресенье'
}
