BTN_MAIN_MENU = 'Главное меню'
BTN_MAIN_GROUP = '👥 Группы'
BTN_MAIN_TEACHER = '👨‍🏫 Преподаватели'
BTN_MAIN_AUDIENCE = '🏢 Аудитории'
BTN_MAIN_FAVORITE = '❤ Избранное'
BTN_MAIN_FEEDBACK = '💬 Обратная связь'

BTN_PREV_DAY = 'Пред. день'
BTN_NEXT_DAY = 'След. день'
BTN_PREV_PAGE = '⬅'
BTN_NEXT_PAGE = '➡'
BTN_PREV_MONTH = '⬅'
BTN_NEXT_MONTH = '➡'
BTN_OPEN_CALENDAR = '📅 Выбрать день'

BTN_BACK = '⏪ Назад'
BTN_SEARCH = '🔍 Поиск'
BTN_CANCLE = '❌ Отмена'
BTN_ADD_FAVORITE = '❤ Добавить в избранное'
BTN_DEL_FAVORITE = '💔 Удалить из избранного'


MSG_MAIN_MENU = '''
Самый теплый бот с расписанием

Мы открыли доступ к исходникам бота. Можете сделать своего или взять какие-то нароботоки из него. По любым вопросам можете написать в обратную связь, мы вам ответим и при необходимости свяжемся.
(ПЫ.СЫ. Код я писал давно, поэтому написан он так себе)
GitHub: https://github.com/Lisovsky-UwU/timetable-sgugit
'''
MSG_SELECT_INSTITUTE = 'Выберите институт'
MSG_SELECT_FORM = 'Выберите тип обучения'
MSG_SELECT_COURSE = 'Выберите курс'
MSG_SELECT_GROUP = 'Выберите группу'
MSG_SELECT_DAY = 'Выберите день'
MSG_SELECT_BUILDING = 'Выберите корпус'
MSG_SELECT_AUDIENCE = 'Выберите аудиторию'
MSG_SELECT_TEACHER = 'Выберите преподавателя'
MSG_SEARCH_TEACHER = 'Отправте сообщение для поиска'
MSG_SELECT_FAVORITE = '❤ Избранное'
MSG_FEEDBACK = '''
Вы можете оставить свои предложения по улучшению бота, комментарий или благодарность через сообщения. Особенно разработчики любят приятные слова :)
Мы Вам обязательно ответим.
P.S. Спасибо, что пользуетесь Тихим Ботом.
P.P.S. Если вы ответите на сообщение бота, то мы его увидеть не сможем, пожалуйста, пишите все сообщения через этот раздел.
'''
MSG_FEEDBACK_IS_SEND = '✅ Сообщение получено. Благодарим Вас за обратную связь.'
MSG_FEEDBACK_SEND_TO = 'Пользователь: @{}'
MSG_FEEDBACK_REPLY_IS_SEND = '✅ Ответ отправлен'
MSG_FEEDBACK_REPLY_NOT_SEND = '❌ Ответ не был отправлен: {}'


PREFIX_GROUP = '👥 Группа '
PREFIX_TEACHER = '👨‍🏫 '
PREFIX_AUDIENCE = '🏢 Аудитория '


MSG_GROUP_LESSON_LIST = '''
Группа {}
Дата {}
{} неделя
{}
'''

NO_LESSON_ON_DAY = '\n❌ На выбранный день пар нет'

LESSON_GROUP_INFO = '''
{}. {}
📚 {}
👨‍🏫 {}
🎓 {}
🏢 {}
'''


MSG_TEACHER_LESSON_LIST = '''
Преподаватель {}
Дата {}
{} неделя
{}
'''

LESSON_TEACHER_INFO = '''
{}. {}
📚 {}
👥 {}
🎓 {}
🏢 {}
'''


MSG_AUDIENCE_LESSON_LIST = '''
Аудитория {}
Дата {}
{} неделя
{}
'''

LESSON_AUDIENCE_INFO = '''
{}. {}
📚 {}
👨‍🏫 {}
👥 {}
🎓 {}
'''
